sample_app/app/views/posts/searched_index.html.erb

                    <%if @current_user!=nil%>
                        <%if Like.find_by(post_id:post.id,user_id:@current_user.id)%>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 52], ["user_id", 26], ["LIMIT", 1]]