sample_app/app/controllers/likes_controller.rb

    def likes_create
        @post=Post.find_by(id:params[:id])
        @like=Like.new(user_id:@current_user.id,post_id:params[:id])
        @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 14], ["post_id", 29], ["created_at", "2022-08-21 16:20:09.997256"], ["updated_at", "2022-08-21 16:20:09.997256"]]

    def likes_destroy
        @post=Post.find_by(id:params[:id])
        @like=Like.find_by(user_id:@current_user.id,post_id:params[:id])
        @like.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 14], ["post_id", 29], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]