sample_app/app/controllers/posts_controller.rb

  def new
    @posts=Post.all
---
SELECT "posts".* FROM "posts"

  def searched_index
    if params[:searched] ==""
      @posts=Post.all
    else
      @posts=Post.where(title:params[:searched])
---
SELECT "posts".* FROM "posts" WHERE (title like '%params[:searched]%')
SELECT "posts".* FROM "posts" WHERE "posts"."title" = ?  [["title", "AI"]]