sample_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("post_image1", "post_image2", "post_image3", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @post=Post.new(
      post_image1:nil,
      post_image2:nil,
      post_image3:nil,
      title:params[:title],
      content:params[:content],
      user_id:@current_user.id
    )

    if params[:post_image1]
      @post.post_image1=params[:post_image1]
    end

    if params[:post_image2]
      @post.post_image2=params[:post_image2]
    end

    if params[:post_image3]
      @post.post_image3=params[:post_image3]
    end


    @post.save

UPDATE "posts" SET "post_image1" = ?, "post_image2" = ?, "post_image3" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post_image1", "49.png"], ["post_image2", "49.png"], ["post_image3", "49.png"], ["updated_at", "2022-09-01 03:33:28.101647"], ["id", 49]]
---



    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 45]]
---
  def show
    @post=Post.find_by(id:params[:id])
    @reviews=Review.all
    @likes_count = Like.where(post_id: @post.id).count

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
  def ensure_user
    @post=Post.find_by(id:params[:id])