sample_app/app/controllers/posts_controller.rb

  def create

    @post=Post.new(
      post_image1:params[:post_image1],
      post_image2:params[:post_image2],
      post_image3:params[:post_image3],
      title:params[:title],
      content:params[:content],
      user_id:@current_user.id
      )
    @post.save
---
INSERT INTO "posts" ("post_image1", "post_image2", "post_image3", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @post=Post.find_by(id:params[:id])
    @reviews=Review.all
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 28]]