sample_app/app/controllers/reviews_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 7], ["post_id", nil], ["content", "凄い"], ["created_at", "2022-08-18 10:17:10.430286"], ["updated_at", "2022-08-18 10:17:10.430286"]]
---
    def reviews_create
        @post=Post.find_by(id:params[:id])
        @review=Review.new(user_id:@current_user.id,post_id:@post.id,content:params[:content])
        @review.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."post_id" = ? LIMIT ?  [["user_id", 20], ["post_id", 32], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
    def reviews_destroy
        @post=Post.find_by(id:params[:id])
        @review=Review.find_by(user_id:@current_user.id,post_id:params[:id])
        @review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def ensure_user
        @review=Review.find_by(id:params[:id])