sample_app/app/controllers/users_controller.rb

  def create
    @user = User.new(
            name:params[:name],
            email:params[:email],
            password:params[:password],
            user_image:"icons8-ユーザー-50.png"
            )
    @user.save
---
INSERT INTO "users" ("email", "name", "password", "user_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "l"], ["name", "k"], ["password", "[FILTERED]"], ["user_image", "icons8-ユーザー-50.png"], ["created_at", "2022-08-17 14:50:56.333872"], ["updated_at", "2022-08-17 14:50:56.333872"]]

  def show
    @user=User.find_by(id:params[:id])
    @posts=Post.where(user_id:@current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]